Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File            : main.c
  * Brief           : PlusCart(+) Firmware
  * Author          : Wolfgang Stubig <w.stubig@firmaplus.de>
  * Website         : https://gitlab.com/firmaplus/atari-2600-pluscart
  ******************************************************************************
  * (c) 2019 Wolfgang Stubig (Al_Nafuur)
  * based on: UnoCart2600 by Robin Edwards (ElectroTrains)
  *           https://github.com/robinhedwards/UnoCart-2600
  *           and
  *           UnoCart2600 fork by Christian Speckner (DirtyHairy)
  *           https://github.com/DirtyHairy/UnoCart-2600
  ******************************************************************************
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

#include "main.h"
#include "font.h"
#include "esp8266.h"
#include "flash.h"
#include "cartridge_io.h"
#include "cartridge_firmware.h"
#include "cartridge_emulation_ar.h"
#include "cartridge_detection.h"
#include "cartridge_emulation.h"
#include "cartridge_emulation_df.h"
#include "cartridge_emulation_bf.h"
#include "cartridge_emulation_sb.h"
#include "cartridge_emulation_dpcp.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef struct {
	enum cart_base_type base_type;
	bool withSuperChip;
	bool withPlusFunctions;
	uint32_t flash_part_address;
} CART_TYPE;

typedef struct {
	const char *ext;
	CART_TYPE cart_type;
} EXT_TO_CART_TYPE_MAP;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

const EXT_TO_CART_TYPE_MAP ext_to_cart_type_map[]__attribute__((section(".flash01"))) = {
	{"ROM",  { base_type_None, false, false }},
	{"BIN",  { base_type_None, false, false }},
	{"A26",  { base_type_None, false, false }},
	{"2K",   { base_type_2K, false, false }},
	{"4K",   { base_type_4K, false, false }},
	{"4KS",  { base_type_4K, true, false }},
	{"F8",   { base_type_F8, false, false }},
	{"F6",   { base_type_F6, false, false }},
	{"F4",   { base_type_F4, false, false }},
	{"F8S",  { base_type_F8, true, false }},
	{"F6S",  { base_type_F6, true, false }},
	{"F4S",  { base_type_F4, true, false }},
	{"FE",   { base_type_FE, false, false }},
	{"3F",   { base_type_3F, false, false }},
	{"3E",   { base_type_3E, false, false }},
	{"E0",   { base_type_E0, false, false }},
	{"084",  { base_type_0840, false, false }},
	{"CV",   { base_type_CV, false, false }},
	{"EF",   { base_type_EF, false, false }},
	{"EFS",  { base_type_EF, true, false }},
	{"F0",   { base_type_F0, false, false }},
	{"FA",   { base_type_FA, false, false }},
	{"E7",   { base_type_E7, false, false }},
	{"DPC",  { base_type_DPC, false, false }},
	{"AR",   { base_type_AR, false, false }},
	{"BF",   { base_type_BF, false, false }},
	{"BFS",  { base_type_BFSC, false, false }},
	{"ACE",  { base_type_ACE, false, false }},
	{"WD",   { base_type_PP, false, false }},
	{"DF",   { base_type_DF, false, false }},
	{"DFS",  { base_type_DFSC, false, false }},
	{"3EP",  { base_type_3EPlus, false, false }},
	{"DPCP", { base_type_DPCplus, false, false }},
	{"SB",   { base_type_SB, false, false }},

	{0,{0,0,0}}
};

static const char status_message[][28]__attribute__((section(".flash01"))) = {
		"PlusCart(+) by W.Stubig"          ,
		"PlusCart(+) Ver. " VERSION        ,
		"PlusCart(+)"                      ,
		"Select your WiFi Network"         ,
		"No WiFi"                          ,
		"WiFi connected"                   ,
		"Request timeout"                  ,
		"Enter WiFi Password"              ,
		"Enter email or username"          ,
		"Connected, email sent"            ,
		"User created, email sent"         ,
		"PlusStore connect failed"         ,
		"Disconnected from PlusStore"      ,
		"Enter Secret-Key"                 ,
		"Secret-Key saved"                 ,
		"Offline ROMs erased"              ,
		"ROM file too big!"                ,
		"ACE is not supported"             ,
		"Unknown/invalid ROM"              ,
		"Done"                             ,
		"Failed"                           ,
		"Firmware download failed"         ,
		"Offline ROMs detected"            ,
		"No offline ROMs detected"         ,
		"DPC+ is not supported"            ,
		"Emulation exited"
};


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;


/* USER CODE BEGIN PV */
int num_menu_entries = 0;
char http_request_header[512];//__attribute__ ((section (".noinit")));

uint8_t buffer[BUFFER_SIZE * 1024] __attribute__((section(".buffer")));
unsigned int cart_size_bytes;

USER_SETTINGS user_settings;

char curPath[256];

uint8_t plus_store_status[1];

MENU_ENTRY menu_entries[NUM_MENU_ITEMS] __attribute__((section(".ccmram")));


/* USER CODE END PV */

