Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
enum e_status_message buildMenuFromPath( MENU_ENTRY * )__attribute__((section(".flash0"))) ;
void append_entry_to_path(MENU_ENTRY *);



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */




/*************************************************************************
 * Menu Handling
 *************************************************************************/

char *get_filename_ext(char *filename) {
	char *dot = strrchr(filename, '.');
	if(!dot || dot == filename) return "";
	return (dot + 1);
}

void make_menu_entry( MENU_ENTRY **dst, char *name, int type){
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)->font = user_settings.font_style;
	(*dst)++;
	num_menu_entries++;
}

void make_menu_entry_font( MENU_ENTRY **dst, char *name, int type, uint8_t font) {
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)->font = font;
	(*dst)++;
	num_menu_entries++;
}


void make_keyboard(MENU_ENTRY **dst){
	make_menu_entry(&(*dst), MENU_TEXT_GO_BACK, Leave_Menu);
	make_menu_entry(&(*dst), MENU_TEXT_DELETE_CHAR, Delete_Keyboard_Char);
	char Key[2] = "0";
	for (char i=32; i < 100; i++){
		Key[0] = i;
		make_menu_entry(&(*dst), Key, Keyboard_Char);
	}
	make_menu_entry(&(*dst), "Enter", Menu_Action);

}

MENU_ENTRY* generateSetupMenu(MENU_ENTRY *dst) {
	make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
	make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_FONT_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_WIFI_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_WPS_CONNECT, Menu_Action);
	make_menu_entry(&dst, MENU_TEXT_WIFI_MANGER, Menu_Action);
	//make_menu_entry(&dst, MENU_TEXT_PRIVATE_KEY, Input_Field);
	make_menu_entry(&dst, MENU_TEXT_ESP8266_RESTORE, Menu_Action);
	if (flash_has_downloaded_roms())
		make_menu_entry(&dst, MENU_TEXT_DELETE_OFFLINE_ROMS, Menu_Action);
	else
		make_menu_entry(&dst, MENU_TEXT_DETECT_OFFLINE_ROMS, Menu_Action);

	return dst;
}

enum e_status_message buildMenuFromPath( MENU_ENTRY *d )  {
	int count = 0;
	bool loadStore = false;
	bool is_entry_row;
	uint8_t pos = 0, c;
	num_menu_entries = 0;
	enum e_status_message menu_status = none;

	char *menu_text[] = {
			// same ordering as font IDs
			MENU_TEXT_FONT_TJZ,
			MENU_TEXT_FONT_TRICHOTOMIC12,
			MENU_TEXT_FONT_CAPTAIN_MORGAN_SPICE,
			MENU_TEXT_FONT_GLACIER_BELLE
	};

	char *tvModes[] = {
			0,
			MENU_TEXT_TV_MODE_NTSC,		// -->1
			MENU_TEXT_TV_MODE_PAL,		// -->2
			MENU_TEXT_TV_MODE_PAL60,	// -->3
	};


	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];

	if(strncmp(MENU_TEXT_SETUP, curPath, sizeof(MENU_TEXT_SETUP) - 1) == 0 ){
		//char *  curPathPos = (char *) &curPath[sizeof(MENU_TEXT_SETUP)];
		if(strlen(curPath) == sizeof(MENU_TEXT_SETUP) - 1 ){
			dst = generateSetupMenu(dst);
        	menu_status = version;
			loadStore = true;
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_SETUP, sizeof(MENU_TEXT_WIFI_SETUP) - 1) == 0 ){
			if(strlen(curPath) > sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) ){
				if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
					// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" SSID[33] + Password + "/Enter" + '\0'
					curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path

					// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					int i = sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP);
			        while( curPath[i] != 30 && i < ( sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 31) ){
			            i++;
			        }
			        curPath[i] = 0;

			    	if(esp8266_wifi_connect( &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP)  ], &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 32])){
			        	menu_status = wifi_connected;
			    	}else{
			        	menu_status = wifi_not_connected;
			    	}
					curPath[0] = '\0';
				}else{
					if(d->type == Setup_Menu){
						menu_status = insert_password;
					}
					make_keyboard(&dst);
				}

			}else{
				menu_status = select_wifi_network;
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
		    		return esp_timeout;
		    	}
			}
		}else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_TV_MODE_SETUP, sizeof(MENU_TEXT_TV_MODE_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){

				uint8_t new_tv_mode = TV_MODE_NTSC;
				while ( strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + 2 + sizeof(MENU_TEXT_TV_MODE_SETUP)],
						&tvModes[new_tv_mode][2]) != 0)
					new_tv_mode++;

				set_tv_mode(new_tv_mode);
				if(user_settings.tv_mode != new_tv_mode){
					user_settings.tv_mode = new_tv_mode;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);


				for (int tv = 1; tv < sizeof tvModes / sizeof *tvModes; tv++) {
					char tvLine[33];
					strcpy(tvLine, tvModes[tv]);
					if (user_settings.tv_mode == tv)
						tvLine[0] = CHAR_SELECTION;
					make_menu_entry(&dst, tvLine, Menu_Action);
				}
			}

		}else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_FONT_SETUP, sizeof(MENU_TEXT_FONT_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){

				uint8_t new_font_style = 0;
				while ( strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + 2 + sizeof(MENU_TEXT_FONT_SETUP)],
						&menu_text[new_font_style][2]) != 0)
					new_font_style++;

				//set_my_font(new_font_style);

				if(user_settings.font_style != new_font_style){
					user_settings.font_style = new_font_style;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

				uint8_t fontCount = sizeof menu_text / sizeof *menu_text;
				char fontLine[fontCount][33];
				for (uint8_t font=0; font < fontCount; font++) {
					strcpy(fontLine[font], menu_text[font]);
					fontLine[font][0] = user_settings.font_style == font ? CHAR_SELECTION: ' ';

					//set_my_font(font);
					make_menu_entry_font(&dst,
							fontLine[font],
							Menu_Action,
							font);
				}
				//set_my_font(user_settings.font_style);
			}

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT, sizeof(MENU_TEXT_PLUS_CONNECT) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user
				if( esp8266_PlusStore_API_connect() == false){
					return esp_timeout;
				}
				esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
	        	esp8266_print(http_request_header);
	        	esp8266_skip_http_response_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}
	        	if(c == '0'){
	        		menu_status = plus_connect_failed;
	        	}else if(c == '1'){
	        		menu_status = plus_created;
	        	}else{
	        		menu_status = plus_connected;
	        	}

	        	esp8266_PlusStore_API_end_transmission();

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT) == 0){
					menu_status = plus_connect;
				}
				make_keyboard(&dst);
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_REMOVE, sizeof(MENU_TEXT_PLUS_REMOVE) - 1) == 0 ){
			if( esp8266_PlusStore_API_connect() == false){
				return esp_timeout;
			}
			esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
        	esp8266_print(http_request_header);

